AWS_RedisCluster/6_redis/2Stress_vm2.txt
====== PING_INLINE ======
  100000 requests completed in 3.18 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

4.66% <= 1 milliseconds
91.64% <= 2 milliseconds
99.01% <= 3 milliseconds
99.54% <= 4 milliseconds
99.81% <= 5 milliseconds
99.91% <= 6 milliseconds
99.93% <= 7 milliseconds
99.94% <= 8 milliseconds
99.97% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 10 milliseconds
31436.65 requests per second

====== PING_BULK ======
  100000 requests completed in 3.06 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.53% <= 1 milliseconds
98.11% <= 2 milliseconds
99.47% <= 3 milliseconds
99.68% <= 4 milliseconds
99.77% <= 5 milliseconds
99.81% <= 6 milliseconds
99.85% <= 7 milliseconds
99.85% <= 8 milliseconds
99.88% <= 9 milliseconds
99.91% <= 10 milliseconds
99.93% <= 11 milliseconds
99.94% <= 12 milliseconds
99.95% <= 13 milliseconds
99.98% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 15 milliseconds
32647.73 requests per second

====== SET ======
  100000 requests completed in 3.04 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.39% <= 1 milliseconds
98.32% <= 2 milliseconds
99.53% <= 3 milliseconds
99.76% <= 4 milliseconds
99.88% <= 5 milliseconds
99.96% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 7 milliseconds
32916.39 requests per second

====== GET ======
  100000 requests completed in 3.08 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.44% <= 1 milliseconds
96.62% <= 2 milliseconds
99.61% <= 3 milliseconds
99.78% <= 4 milliseconds
99.92% <= 5 milliseconds
99.94% <= 6 milliseconds
100.00% <= 6 milliseconds
32435.94 requests per second

====== INCR ======
  100000 requests completed in 3.61 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.33% <= 1 milliseconds
76.01% <= 2 milliseconds
99.41% <= 3 milliseconds
99.79% <= 4 milliseconds
99.89% <= 5 milliseconds
99.94% <= 6 milliseconds
99.95% <= 7 milliseconds
99.96% <= 8 milliseconds
99.96% <= 9 milliseconds
99.98% <= 10 milliseconds
100.00% <= 11 milliseconds
27731.56 requests per second

====== LPUSH ======
  100000 requests completed in 3.64 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.56% <= 1 milliseconds
77.72% <= 2 milliseconds
98.95% <= 3 milliseconds
99.92% <= 4 milliseconds
99.97% <= 5 milliseconds
100.00% <= 5 milliseconds
27472.53 requests per second

====== RPUSH ======
  100000 requests completed in 3.55 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.41% <= 1 milliseconds
80.13% <= 2 milliseconds
99.59% <= 3 milliseconds
99.85% <= 4 milliseconds
99.93% <= 5 milliseconds
99.95% <= 6 milliseconds
99.95% <= 7 milliseconds
99.97% <= 8 milliseconds
99.99% <= 9 milliseconds
100.00% <= 9 milliseconds
28176.95 requests per second

====== LPOP ======
  100000 requests completed in 3.46 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.58% <= 1 milliseconds
81.61% <= 2 milliseconds
99.80% <= 3 milliseconds
99.89% <= 4 milliseconds
99.93% <= 5 milliseconds
99.95% <= 12 milliseconds
99.96% <= 13 milliseconds
99.99% <= 14 milliseconds
100.00% <= 14 milliseconds
28885.04 requests per second

====== RPOP ======
  100000 requests completed in 3.12 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

7.45% <= 1 milliseconds
89.70% <= 2 milliseconds
99.59% <= 3 milliseconds
99.85% <= 4 milliseconds
99.90% <= 5 milliseconds
99.95% <= 6 milliseconds
100.00% <= 6 milliseconds
32061.56 requests per second

====== SADD ======
  100000 requests completed in 3.16 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

1.40% <= 1 milliseconds
95.16% <= 2 milliseconds
97.51% <= 3 milliseconds
99.08% <= 4 milliseconds
99.92% <= 5 milliseconds
100.00% <= 5 milliseconds
31675.64 requests per second

====== HSET ======
  100000 requests completed in 3.02 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

1.02% <= 1 milliseconds
97.43% <= 2 milliseconds
98.72% <= 3 milliseconds
99.48% <= 4 milliseconds
99.97% <= 5 milliseconds
100.00% <= 5 milliseconds
33079.72 requests per second

====== SPOP ======
  100000 requests completed in 3.00 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

1.09% <= 1 milliseconds
98.24% <= 2 milliseconds
99.64% <= 3 milliseconds
99.77% <= 4 milliseconds
99.93% <= 5 milliseconds
99.95% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 7 milliseconds
33377.84 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 3.03 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

1.02% <= 1 milliseconds
97.11% <= 2 milliseconds
99.05% <= 3 milliseconds
99.64% <= 4 milliseconds
99.92% <= 5 milliseconds
99.97% <= 6 milliseconds
100.00% <= 6 milliseconds
33003.30 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.44 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.32% <= 1 milliseconds
84.36% <= 2 milliseconds
99.47% <= 3 milliseconds
99.77% <= 4 milliseconds
99.92% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
29027.58 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 3.08 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.74% <= 1 milliseconds
97.00% <= 2 milliseconds
99.25% <= 3 milliseconds
99.42% <= 4 milliseconds
99.90% <= 5 milliseconds
99.95% <= 11 milliseconds
99.96% <= 12 milliseconds
99.98% <= 13 milliseconds
100.00% <= 14 milliseconds
100.00% <= 14 milliseconds
32478.08 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 2.87 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

4.92% <= 1 milliseconds
96.36% <= 2 milliseconds
99.20% <= 3 milliseconds
99.73% <= 4 milliseconds
99.96% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 6 milliseconds
34843.21 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 3.09 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

6.12% <= 1 milliseconds
93.02% <= 2 milliseconds
97.93% <= 3 milliseconds
99.15% <= 4 milliseconds
99.67% <= 5 milliseconds
99.88% <= 6 milliseconds
99.90% <= 8 milliseconds
99.91% <= 9 milliseconds
99.92% <= 10 milliseconds
99.94% <= 11 milliseconds
99.95% <= 13 milliseconds
99.98% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 15 milliseconds
32383.42 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

11.43% <= 1 milliseconds
96.81% <= 2 milliseconds
98.89% <= 3 milliseconds
99.26% <= 4 milliseconds
99.51% <= 5 milliseconds
99.75% <= 6 milliseconds
99.81% <= 7 milliseconds
99.90% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 9 milliseconds
35663.34 requests per second